src/Enums/Страны/Страны.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Страны</name>
  <enumValues>
    <name>Казахстан</name>
  </enumValues>
  <enumValues>
    <name>Узбекистан</name>
  </enumValues>
  <enumValues>
    <name>Россия</name>
  </enumValues>
  <enumValues>
    <name>Беларусь</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ОкружениеОператораМаркировки/ОкружениеОператораМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОкружениеОператораМаркировки</name>
  <enumValues>
    <name>Рабочий</name>
  </enumValues>
  <enumValues>
    <name>Тестовый</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ОператорыМаркировки/ОператорыМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОператорыМаркировки</name>
  <attributes>
    <name>Страна</name>
    <type>
      <types>EnumRef.Страны</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочийURL</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкружениеОператораМаркировки</name>
    <type>
      <types>EnumRef.ОкружениеОператораМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>Активный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючAPI</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Таймаут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonModules/НастройкиОбменаМаркировкиСервер/Module.bsl
// @strict-types
#Область ПрограммныйИнтерфейс

// Формирует текст модального вопроса перед отправкой запроса на сервер.
// Используется для отображения пользователю с кнопками "Продолжить" / "Отменить".
//
// Параметры:
//  СтранаМаркировки - ПеречислениеСсылка.Страны - страна оператора (Казахстан, Узбекистан, Россия, Беларусь).
//  Окружение - ПеречислениеСсылка.ОкружениеОператораМаркировки - Рабочий или Тестовый.
//
// Возвращаемое значение:
//  Строка - текст для диалога, например "Запрос будет отправлен на тестовый сервер (Казахстан). Продолжить?"
//
Функция ПолучитьТекстПодтвержденияОтправки(СтранаМаркировки, Окружение) Экспорт
	ИменаСтран = Новый Соответствие;
	ИменаСтран.Вставить(Перечисления.Страны.Казахстан, "Казахстан");
	ИменаСтран.Вставить(Перечисления.Страны.Узбекистан, "Узбекистан");
	ИменаСтран.Вставить(Перечисления.Страны.Россия, "Россия");
	ИменаСтран.Вставить(Перечисления.Страны.Беларусь, "Беларусь");

	ИмяСтраны = ИменаСтран.Получить(СтранаМаркировки);
	Если Не ЗначениеЗаполнено(ИмяСтраны) Тогда
		ИмяСтраны = "не указана";
	КонецЕсли;

	ТекстОкружения = ?(Окружение = Перечисления.ОкружениеОператораМаркировки.Тестовый, "тестовый", "рабочий");
	Возврат СтрШаблон("Запрос будет отправлен на %1 сервер (%2). Продолжить?", ТекстОкружения, ИмяСтраны);
КонецФункции

// Возвращает признак необходимости показывать модальный вопрос перед отправкой запроса на API.
// Если константа МаркировкаОтключитьМодальныеВопросыПередОтправкой = Истина, вопрос не показывается (режим тестирования).
//
// Возвращаемое значение:
//  Булево - Истина, если нужно показать вопрос, Ложь если отправлять без диалога.
//
Функция НуженМодальныйВопросПередОтправкой() Экспорт
	// Константа МаркировкаОтключитьМодальныеВопросыПередОтправкой: Истина — не показывать вопрос (режим тестирования).
	МодальныйВопрос = Константы.МаркировкаОтключитьМодальныеВопросыПередОтправкой.Получить();
	Если Не ЗначениеЗаполнено(МодальныйВопрос) Тогда
		Возврат Ложь;
	КонецЕсли;

//	Возврат Не (Знач = Истина);
КонецФункции

// Возвращает данные активного оператора маркировки для указанной страны (из справочника ОператорыМаркировки).
// Для одной страны может быть активна только одна запись (Активный = Истина).
//
// Параметры:
//  СтранаМаркировки - ПеречислениеСсылка.Страны
//
// Возвращаемое значение:
//  Структура - Ключи: РабочийURL, ОкружениеОператораМаркировки, КлючAPI, Таймаут. Пустая структура, если активный оператор не найден.
//
Функция ПолучитьДанныеАктивногоОператора(СтранаМаркировки) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОператорыМаркировки.РабочийURL КАК РабочийURL,
		|	ОператорыМаркировки.ОкружениеОператораМаркировки КАК ОкружениеОператораМаркировки,
		|	ОператорыМаркировки.КлючAPI КАК КлючAPI,
		|	ОператорыМаркировки.Таймаут КАК Таймаут
		|ИЗ
		|	Справочник.ОператорыМаркировки КАК ОператорыМаркировки
		|ГДЕ
		|	ОператорыМаркировки.Страна = &Страна
		|	И ОператорыМаркировки.Активный = ИСТИНА";
	Запрос.УстановитьПараметр("Страна", СтранаМаркировки);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		Данные = Новый Структура;
		Данные.Вставить("РабочийURL", СокрЛП(Выборка.РабочийURL));
		Данные.Вставить("ОкружениеОператораМаркировки", Выборка.ОкружениеОператораМаркировки);
		Данные.Вставить("КлючAPI", СокрЛП(Выборка.КлючAPI));
		Данные.Вставить("Таймаут", Выборка.Таймаут);
		Возврат Данные;
	КонецЕсли;
	Возврат Новый Структура;
КонецФункции

// Возвращает текущее окружение (рабочий или тестовый сервер) для указанной страны.
//
// Параметры:
//  СтранаМаркировки - ПеречислениеСсылка.Страны
//
// Возвращаемое значение:
//  ПеречислениеСсылка.ОкружениеОператораМаркировки - Рабочий или Тестовый
//
Функция ПолучитьОкружениеОператора(СтранаМаркировки) Экспорт
	Данные = ПолучитьДанныеАктивногоОператора(СтранаМаркировки);
	Если Данные.Свойство("ОкружениеОператораМаркировки") И ЗначениеЗаполнено(Данные.ОкружениеОператораМаркировки) Тогда
		Возврат Данные.ОкружениеОператораМаркировки;
	КонецЕсли;
	Возврат Перечисления.ОкружениеОператораМаркировки.Рабочий;
КонецФункции

// Возвращает URL сервера API для указанной страны (активный оператор в справочнике ОператорыМаркировки).
//
// Параметры:
//  СтранаМаркировки - ПеречислениеСсылка.Страны
//
// Возвращаемое значение:
//  Строка - URL для запросов
//
Функция ПолучитьURLОператора(СтранаМаркировки) Экспорт
	Данные = ПолучитьДанныеАктивногоОператора(СтранаМаркировки);
	Если Данные.Свойство("РабочийURL") Тогда
		Возврат Данные.РабочийURL;
	КонецЕсли;
	Возврат "";
КонецФункции

// Возвращает ключ API активного оператора для указанной страны.
//
// Параметры:
//  СтранаМаркировки - ПеречислениеСсылка.Страны
//
// Возвращаемое значение:
//  Строка - ключ/токен API или пустая строка
//
Функция ПолучитьКлючAPI(СтранаМаркировки) Экспорт
	Данные = ПолучитьДанныеАктивногоОператора(СтранаМаркировки);
	Если Данные.Свойство("КлючAPI") Тогда
		Возврат Данные.КлючAPI;
	КонецЕсли;
	Возврат "";
КонецФункции

// Возвращает таймаут HTTP-запроса в секундах для указанной страны.
// Если у активного оператора в справочнике задан реквизит Таймаут и он > 0, возвращается он; иначе — константа МаркировкаТаймаутЗапросаСекунды; при её отсутствии — 30.
//
// Параметры:
//  СтранаМаркировки - ПеречислениеСсылка.Страны
//
Функция ПолучитьТаймаутЗапросаСекунды(СтранаМаркировки) Экспорт
	Данные = ПолучитьДанныеАктивногоОператора(СтранаМаркировки);
	Если Данные.Количество() > 0 И Данные.Свойство("Таймаут") И Данные.Таймаут > 0 Тогда
		Возврат Данные.Таймаут;
	КонецЕсли;
	Знач = Константы.МаркировкаТаймаутЗапросаСекунды.Получить();
	Если Знач > 0 Тогда
		Возврат Знач;
	КонецЕсли;
	Возврат 30;
КонецФункции

#КонецОбласти
